import unittest, strutils, times, options
include src/inspectlog

const log1 = """
20201019133124,10.20.30.1/16,2
20201019133125,10.20.30.2/16,1
20201019133134,192.168.1.1/24,10
20201019133135,192.168.1.2/24,5
20201019133224,10.20.30.1/16,522
20201019133225,10.20.30.2/16,1
20201019133234,192.168.1.1/24,8
20201019133235,192.168.1.2/24,15
20201019133324,10.20.30.1/16,-
20201019133325,10.20.30.2/16,2
"""

const log2 = """
20201019133124,10.20.30.1/16,2
20201019133125,10.20.30.2/16,1
20201019133134,192.168.1.1/24,-
20201019133135,192.168.1.2/24,-
20201019133224,10.20.30.1/16,522
20201019133225,10.20.30.2/16,1
20201019133234,192.168.1.1/24,-
20201019133235,192.168.1.2/24,-
20201019133324,10.20.30.1/16,-
20201019133325,10.20.30.2/16,2
"""

suite "設問 1":
  test "応答が無いログが1行の場合":
    let
      logList = initLogInfoList(log1.splitLines)
      downTimes = getDownTimes(logList)

    check downTimes.len == 1

    # "$" によりstring型に変換
    check $downTimes[0].Start.get == "2020-01-19T13:33:24+09:00"
    check $downTimes[0].End.get == "2020-01-19T13:33:25+09:00"

  test "応答が無いログが複数行かつ2回の場合":
    let
      logList = initLogInfoList(log2.splitLines)
      downTimes = getDownTimes(logList)

    check downTimes.len == 2

    check $downTimes[0].Start.get == "2020-01-19T13:31:34+09:00"
    check $downTimes[0].End.get == "2020-01-19T13:32:24+09:00"

    check $downTimes[1].Start.get == "2020-01-19T13:32:34+09:00"
    check $downTimes[1].End.get == "2020-01-19T13:33:25+09:00"
